<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>This recipe does not behave like standard jamf recipes. After downloading and packaging the app, multiple smart groups and policies are created or updated. This recipe is intended for use with the Auto-Update workflow available at https://github.com/mhrono/Auto-Update.</string>
		<key>Identifier</key>
		<string>com.mhrono.recipes.jamf.amazonchime</string>
		<key>MinimumVersion</key>
		<real>2.3</real>
		<key>ParentRecipe</key>
		<string>com.mhrono.recipes.pkg.amazonchime</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Amazon Chime</string>
			<key>APP_BUNDLE_ID</key>
			<string>com.amazon.Amazon-Chime</string>
			<key>CATEGORY</key>
			<string>Collaboration</string>
			<key>TRIGGER_NAME</key>
			<string>autoupdate-%NAME%</string>
			<key>DEFER_TRIGGER</key>
			<string>defer-%NAME%</string>
			<key>DEFER_LIMIT</key>
			<integer>10</integer>
			<key>FORCE_UPDATE</key>
			<string>False</string>
			<key>ROLLBACK</key>
			<string>False</string>
			<key>SELF_SERVICE_VISIBLE</key>
			<string>True</string>
			<key>SELF_SERVICE_DESCRIPTION</key>
			<string>Meet, chat, and place business phone calls with a single, secure application.</string>
			<key>SELF_SERVICE_ICON</key>
			<string>Amazon_Chime.png</string>
			<key>PYTHON3_PATH</key>
			<string></string>
			<key>SWIFTPATCH_PATH</key>
			<string></string>
			<key>UPDATE_PREDICATE</key>
			<string>pkg_uploaded == False</string>
			<key>STOP_PREDICATE</key>
			<string>NOT virus_total_analyzer_summary_result.data.ratio BEGINSWITH '0'</string>
			<key>SELF_SERVICE_PREDICATE</key>
			<string>SELF_SERVICE_VISIBLE == 'False'</string>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>io.github.hjuutilainen.VirusTotalAnalyzer/VirusTotalAnalyzer</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>%STOP_PREDICATE%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
				<key>Arguments</key>
				<dict>
					<key>category_name</key>
					<string>%CATEGORY%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_category</key>
					<string>AutoPkg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>%UPDATE_PREDICATE%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.jgstew.SharedProcessors/FileGetStat</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
				<key>Arguments</key>
				<dict>
					<key>computergroup_template</key>
					<string>SmartGroupTemplate-autopatch-regex.xml</string>
					<key>computergroup_name</key>
					<string>autoupdate-%NAME%</string>
					<key>replace_group</key>
					<string>True</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
				<key>Arguments</key>
				<dict>
					<key>computergroup_template</key>
					<string>SmartGroupTemplate-notinstalled.xml</string>
					<key>computergroup_name</key>
					<string>App Not Installed: %NAME%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
				<key>Arguments</key>
				<dict>
					<key>computergroup_template</key>
					<string>SmartGroupTemplate-installed.xml</string>
					<key>computergroup_name</key>
					<string>App Installed: %NAME%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
				<key>Arguments</key>
				<dict>
					<key>policy_template</key>
					<string>PolicyTemplate-autopatch.xml</string>
					<key>policy_name</key>
					<string>Install Latest %NAME%</string>
					<key>frequency</key>
					<string>Ongoing</string>
					<key>checkin_bool</key>
					<string>false</string>
					<key>trigger_name</key>
					<string>%TRIGGER_NAME%</string>
					<key>policy_category</key>
					<string>AutoPkg</string>
					<key>group_name</key>
					<string>autoupdate-%NAME%</string>
					<key>self_service_bool</key>
					<string>false</string>
					<key>self_service_action</key>
					<string>Install</string>
					<key>replace_policy</key>
					<string>True</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
				<key>Arguments</key>
				<dict>
					<key>policy_template</key>
					<string>PolicyTemplate-selfservice-update.xml</string>
					<key>policy_name</key>
					<string>Update %NAME%</string>
					<key>frequency</key>
					<string>Ongoing</string>
					<key>checkin_bool</key>
					<string>false</string>
					<key>policy_category</key>
					<string>Updates</string>
					<key>group_name</key>
					<string>autoupdate-%NAME%</string>
					<key>self_service_bool</key>
					<string>true</string>
					<key>self_service_action</key>
					<string>Update to</string>
					<key>icon</key>
					<string>%SELF_SERVICE_ICON%</string>
					<key>replace_policy</key>
					<string>True</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader</string>
				<key>Arguments</key>
				<dict>
					<key>profile_name</key>
					<string>App Update Data: %NAME%</string>
					<key>identifier</key>
					<string>com.appUpdates.managedApps.%NAME%</string>
					<key>organization</key>
					<string>AutoPkg</string>
					<key>payload</key>
					<string>payloadTemplate.plist</string>
					<key>profile_template</key>
					<string>ConfigProfileTemplate-autopatch.xml</string>
					<key>profile_category</key>
					<string>AutoPkg</string>
					<key>replace_profile</key>
					<string>True</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>%SELF_SERVICE_PREDICATE%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
				<key>Arguments</key>
				<dict>
					<key>policy_template</key>
					<string>PolicyTemplate-selfservice-install.xml</string>
					<key>policy_name</key>
					<string>Install %NAME%</string>
					<key>frequency</key>
					<string>Ongoing</string>
					<key>checkin_bool</key>
					<string>false</string>
					<key>policy_category</key>
					<string>%CATEGORY%</string>
					<key>group_name</key>
					<string>App Not Installed: %NAME%</string>
					<key>self_service_bool</key>
					<string>true</string>
					<key>self_service_action</key>
					<string>Install</string>
					<key>icon</key>
					<string>%SELF_SERVICE_ICON%</string>
					<key>replace_policy</key>
					<string>True</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
				<key>Arguments</key>
				<dict>
					<key>policy_template</key>
					<string>PolicyTemplate-selfservice-reinstall.xml</string>
					<key>policy_name</key>
					<string>Re-Install %NAME%</string>
					<key>frequency</key>
					<string>Ongoing</string>
					<key>checkin_bool</key>
					<string>false</string>
					<key>policy_category</key>
					<string>%CATEGORY%</string>
					<key>group_name</key>
					<string>App Installed: %NAME%</string>
					<key>exclude_group_name</key>
					<string>autoupdate-%NAME%</string>
					<key>self_service_bool</key>
					<string>true</string>
					<key>self_service_action</key>
					<string>Re-Install</string>
					<key>icon</key>
					<string>%SELF_SERVICE_ICON%</string>
					<key>replace_policy</key>
					<string>True</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
