<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads and builds a package of the latest Amazon Chime for Mac</string>
		<key>Identifier</key>
		<string>com.mhrono.recipes.pkg.amazonchime</string>
		<key>ParentRecipe</key>
		<string>com.mhrono.recipes.download.amazonchime</string>
		<key>MinimumVersion</key>
		<real>2.3</real>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Amazon Chime</string>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>Versioner</string>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%pathname%/%NAME%.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>AppPkgCreator</string>
			</dict>
		</array>
	</dict>
</plist>
