<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest Amazon Chime for Mac</string>
		<key>Identifier</key>
		<string>com.mhrono.recipes.download.amazonchime</string>
		<key>MinimumVersion</key>
		<real>2.3</real>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Amazon Chime</string>
			<key>URL</key>
			<string>https://clients.chime.aws/mac/latest</string>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>com.github.jgstew.SharedProcessors/URLDownloaderRequests</string>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.dmg</string>
					<key>url</key>
					<string>%URL%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/%NAME%.app</string>
					<key>requirement</key>
					<string>anchor apple generic and identifier "com.amazon.Amazon-Chime" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "94KV3E626L")</string>
					<key>strict_verification</key>
					<true/>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
